tutorials/NACA00122DDyM/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver     displacementLaplacian;

displacementLaplacianCoeffs
{
//        diffusivity           uniform;

//	diffusivity     directional ( 1 200 0 ); 
	diffusivity     inverseDistance (region0_to_wallFilmRegion_wallFilmFaces);
//	diffusivity	uniform;
//	diffusivity     inverseFaceDistance (walls);
//	diffusivity     inversePointDistance (walls);
//	diffusivity     inverseVolume;
//	diffusivity     motionDirectional (1 1000 0);
//	diffusivity     quadratic;
//	diffusivity     exponential;
//	diffusivity	quadratic inverseDistance 1(walls);

//	diffusivity     file;
}


// ************************************************************************* //
